moisesfilho/tab5-os/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_LV_DPI_DEF=130

# LVGL aloca via malloc do sistema (heap com 32MB PSRAM). O default
# LV_USE_BUILTIN_MALLOC usa pool interno de 64KB que nao comporta 3 telas
# (desktop + notas + wifi): lv_obj_create retorna NULL -> assert trava em
# lv_obj_clean (loop WDT). Mesma config do firmware de fabrica da M5Stack.
CONFIG_LV_USE_CLIB_MALLOC=y

# Stack da task main: criacao da UI (desktop+notas+wifi) usa pilha profunda
# de LVGL; 3584 default corrompia o heap e lv_obj_create retornava NULL
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Tab5 usa silício ESP32-P4 rev v1.3 (IDF 5.5.5 default exige rev >= 3.0)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# PSRAM 32MB (obrigatório: framebuffer do MIPI DPI ~1.8MB nao cabe na RAM interna)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
# Buffers estaticos de WiFi/LWIP para PSRAM: a heap interna do P4 (DMA-capable)
# e escassa e durante upload/streaming os pbufs do LWIP esgotavam o bloco DMA
# (httpd 500 "Out of DMA memory"). Com SPIRAM_USE_MALLOC, alocacoes <16KB
# (pbufs ~1.5KB) ficam em RAM interna por padrao; essa opcao os move para PSRAM.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# PSRAM e a memoria principal do P4 (32MB HEX @200MHz, GDMA alcanca PSRAM).
# ALWAYSINTERNAL=0 manda todo malloc()/LVGL/std::string p/ PSRAM, deixando a
# RAM interna (escassa) livre para TCBs de task, buffers DMA explicitos e
# heap_caps internos. Sem isso, a lista de musicas da app consome ~23KB internos
# e a criacao da task de reproducao falha (TCB em RAM interna). RESERVE_INTERNAL
# ja mantem 32KB internos para alocacoes que nao podem usar PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0

# Flash real do Tab5: 16MB (default do IDF é 2MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Particao factory de 4MB (WiFi + UI + SSH cresceram alem do default de 1MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console via USB-Serial-JTAG (Tab5 nao tem ponte USB-UART; UART fisico GPIO 38/37 nao conectado)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FreeRTOS tick 1kHz: esp_hosted recomenda 1000 (com 100 o SDIO fica com jitter e o
# C6 fica sem resposta no send_op_cond 0x107). Mesmo valor do firmware de fabrica da M5Stack.
CONFIG_FREERTOS_HZ=1000

# FATFS com LFN no SD (BSP avisa se desabilitado)
CONFIG_FATFS_LFN_HEAP=y

# WiFi do Tab5: rádio é o ESP32-C6 companion (SDIO2) via esp-hosted (esp_wifi_remote)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# Board Tab5: GPIOs SDIO corretos (CMD=13, CLK=12, D0=11, D1=10, D2=9, D3=8, RESET=15)
CONFIG_ESP32P4_TAB5_C6_BOARD=y
# Reset do C6: ACTIVE_HIGH no esp_hosted 2.x. O 1.4.0 (UserDemo M5Stack) usava #ifdef
# (ACTIVE sempre = HIGH); o 2.x usa #if e com ACTIVE_LOW a sequencia ACTIVE->INACTIVE->ACTIVE
# termina com o C6 em reset (send_op_cond 0x107). ACTIVE_HIGH reproduz o comportamento do 1.4.0.
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
# Mempool SDIO em SPIRAM (RAM interna DMA-capable do P4 é escassa)
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y

# Bluetooth (NimBLE Host sobre ESP-Hosted VHCI no C6)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=48
CONFIG_BT_NIMBLE_ACL_BUF_COUNT=32
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=256
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y
# Transporte HCI exclusivamente via VHCI/esp-hosted (UART-HCI e mutuamente
# exclusivo com VHCI no Kconfig; deixar os dois meio-configurados torna o link
# do driver dependente da ordem do linker)
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
# Chaves de bonding persistidas em NVS: sem isso cada reboot perde as chaves,
# o bt.cfg continua dizendo "pareado" e a reconexao refaz o pairing (ou falha
# com enderecos RPA rotativos, ex. mouses Logitech)
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# MbedTLS Threading, Certificate Bundle e TLS 1.3 (necessário para libssh e HTTPS OpenAI/OpenCode Go)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_THREADING_C=y
CONFIG_MBEDTLS_THREADING_PTHREAD=y
CONFIG_MBEDTLS_THREADING_ALT=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_SSL_TLS1_3_COMPATIBILITY_MODE=y
CONFIG_MBEDTLS_SSL_TLS1_3_KEXM_EPHEMERAL=y
CONFIG_MBEDTLS_SSL_TLS1_3_KEXM_PSK_EPHEMERAL=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SHA512_C=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED=y
CONFIG_MBEDTLS_ECDH_C=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=y
CONFIG_MBEDTLS_HARDWARE_AES=n

CONFIG_MBEDTLS_HARDWARE_GCM=n
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_HARDWARE_SHA=n
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y







# Audio codec: a app Música usa apenas MP3 (decoder) e WAV (simple decoder/PCM).
# Manter todos os decoders/encoders habilitados consome muita RAM interna
# (DMA-capable, escassa no P4) e esgota a heap dos buffers DMA do SD
# (sdmmc_cmd: allocate_dma_buf: not enough mem, err=0x101) -> apps nao listam
# arquivos e a UI pode reiniciar. Desabilitar tudo que nao e usado.
CONFIG_AUDIO_DECODER_MP3_SUPPORT=y
CONFIG_AUDIO_DECODER_PCM_SUPPORT=y
CONFIG_AUDIO_DECODER_AAC_SUPPORT=n
CONFIG_AUDIO_DECODER_G711_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_DECODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_DECODER_FLAC_SUPPORT=n
CONFIG_AUDIO_DECODER_OPUS_SUPPORT=n
CONFIG_AUDIO_DECODER_VORBIS_SUPPORT=n
CONFIG_AUDIO_DECODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_DECODER_ALAC_SUPPORT=n
CONFIG_AUDIO_DECODER_SBC_SUPPORT=n
CONFIG_AUDIO_DECODER_LC3_SUPPORT=n
CONFIG_AUDIO_DECODER_G722_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_WAV_SUPPORT=y
CONFIG_AUDIO_SIMPLE_DEC_M4A_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_TS_SUPPORT=n
CONFIG_AUDIO_SIMPLE_DEC_OGG_SUPPORT=n
CONFIG_AUDIO_ENCODER_AAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_G711_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRNB_SUPPORT=n
CONFIG_AUDIO_ENCODER_AMRWB_SUPPORT=n
CONFIG_AUDIO_ENCODER_OPUS_SUPPORT=n
CONFIG_AUDIO_ENCODER_ADPCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_ALAC_SUPPORT=n
CONFIG_AUDIO_ENCODER_PCM_SUPPORT=n
CONFIG_AUDIO_ENCODER_SBC_SUPPORT=n
CONFIG_AUDIO_ENCODER_LC3_SUPPORT=n
CONFIG_AUDIO_ENCODER_G722_SUPPORT=n

# Camera e MIPI-CSI (Sensor SC202CS / SC2336 no ESP32-P4)
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_CAMERA_SC202CS=y
CONFIG_CAMERA_SC202CS_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_SC202CS_MIPI_RAW8_1280X720_30FPS=y
CONFIG_CAMERA_SC202CS_MIPI_DEFAULT_FMT_RAW8_1280X720_30FPS=y
CONFIG_CAMERA_SC2336=y
CONFIG_CAMERA_SC2336_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_SC2336_MIPI_RAW8_1280X720_30FPS=y
CONFIG_CAMERA_SC2336_MIPI_DEFAULT_FMT_RAW8_1280X720_30FPS=y
CONFIG_LV_USE_SNAPSHOT=y
